#Область ПроведениеДокумента

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.сжсвОтветственные.Записывать = истина;
	
	Для Каждого ТекСтрокаОтветственные Из Ответственные Цикл
		// регистр Ответственные 
		Движение = Движения.сжсвОтветственные.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектОтветственности = ТекСтрокаОтветственные.Сектор;
		Движение.Ответственный = ТекСтрокаОтветственные.Ответственный;
	КонецЦикла;
	Для Каждого ТекСтрокаОтветственныеПоСкладам Из ОтветственныеПоСкладам Цикл
		// регистр Ответственные 
		Движение = Движения.сжсвОтветственные.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектОтветственности = ТекСтрокаОтветственныеПоСкладам.Склад;
		Движение.Ответственный = ТекСтрокаОтветственныеПоСкладам.Ответственный;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти