&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьЗаголовокФормы();
КонецПроцедуры
&НаСервере
Процедура ОбновитьЗаголовокФормы()
	
	Период = ТекущаяДатаСеанса();
	
	ПредставлениеТекущейДаты = Формат(Период, "Л=ru_RU; ДФ='d MMMM, dddd'");
	
	Заголовок = СтрШаблон(НСтр("ru = 'Сегодня: %1'"), ПредставлениеТекущейДаты);
	
КонецПроцедуры
&НаКлиенте
Процедура НазваниеТоматаНажатие(Элемент)
	ОткрытьФорму ("Справочник.НазваниеТомата.Форма.ФормаСписка");
КонецПроцедуры
&НаКлиенте
Процедура АдминистраторНажатие(Элемент)
	ОткрытьФорму ("Обработка.Администратор1С.Форма");
КонецПроцедуры
&НаКлиенте
Процедура БРАУЗЕРНажатие(Элемент)
		ОткрытьФорму ("Обработка.ВебБраузер.Форма.Форма");

КонецПроцедуры
&НаКлиенте
Процедура КонсольЗапросовНажатие(Элемент)
	ОткрытьФорму("Обработка.КонсольЗапросов.Форма"); 
КонецПроцедуры
&НаКлиенте
Процедура РЕЕСТР_КоллекцияНажатие(Элемент)
ОткрытьФорму ("Документ.РЕЕСТР_Коллекция.Форма.ФормаСписка");
КонецПроцедуры
&НаКлиенте
Процедура СписокГеновНажатие(Элемент)
	ОткрытьФорму ("Справочник.СписокГеновТомата.ФормаСписка");
КонецПроцедуры
 &НаКлиенте
Процедура ОбразцыНажатие(Элемент)
ОткрытьФорму("Отчет.Образцы.Форма"); 	
КонецПроцедуры
&НаКлиенте
Процедура НейроНажатие(Элемент)
	ОткрытьФорму("Обработка.УниверсальнаяНейросетьПрогнозирование.Форма");
КонецПроцедуры
 &НаКлиенте
Процедура СписокЗа2020Нажатие(Элемент)
	ОткрытьФорму("Справочник.ГОССОРТ.ФормаСписка");
КонецПроцедуры
&НаКлиенте
Процедура ФайлыНажатие(Элемент)
ОткрытьФорму("Справочник.Файлы.ФормаОбъекта");
КонецПроцедуры

