
&НаКлиенте
Процедура Команда1(Команда)
	Объект.HTML = Адрес;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.HTML.Назад();	
КонецПроцедуры


&НаКлиенте
Процедура АдресОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Объект.HTML = Текст; Адрес = Текст; 
КонецПроцедуры


&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	Адрес = Элемент.Документ.url;
КонецПроцедуры


&НаКлиенте
Процедура яндекс(Команда)
	Объект.HTML = ("www.yandex.ru") ;
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументЗакладка(Элемент)
	Адрес = ("www.yandex.ru");
КонецПроцедуры
