
// ПРОЦЕДУРЫ ФОРМЫ
//======================================================================================================
//======================================================================================================


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры



// ПРОЦЕДУРЫ ЭЛЕМЕНТОВ ФОРМЫ
//======================================================================================================
//======================================================================================================


&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ДобавитьФайлы();

КонецПроцедуры


// ПРОЦЕДУРЫ ПРОЧИЕ
//======================================================================================================
//======================================================================================================

&НаКлиенте
Процедура ДобавитьФайлы()
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Истина;
	ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'", "ru");
	ВыборФайла.Фильтр = НСтр("ru = 'Все файлы'", "ru") + " (*.*)|*.*";
	ВыборФайла.ПредварительныйПросмотр = Истина;
	Если ВыборФайла.Выбрать() Тогда
		
		Для каждого СтрокаФайл Из ВыборФайла.ВыбранныеФайлы Цикл
			
			ОписаниеФайла = Новый Файл(СтрокаФайл);
			
			НВС = СписокФайлов.Добавить();
			НВС.ПолноеИмяФайла   = СтрокаФайл; 
			НВС.РазмерФайла      = ОписаниеФайла.Размер();
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьКаталог()
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ВыборФайла.Выбрать() Тогда
		Файлы = НайтиФайлы(ВыборФайла.Каталог, "*.*", Истина);
		Для каждого СтрокаФайл Из Файлы Цикл
			
			ОписаниеФайла = Новый Файл(СтрокаФайл.ПолноеИмя);
			
			Если СтрокаФайл.ЭтоФайл() Тогда
							
				НВС = СписокФайлов.Добавить();
				НВС.ПолноеИмяФайла   = СтрокаФайл.ПолноеИмя; 
				НВС.РазмерФайла      = ОписаниеФайла.Размер();
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Загрузить()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Если СписокФайлов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Файлы не выбраны !!!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПомещаемыеФайлы = Новый Массив;
	Для каждого СтрокаФайл Из СписокФайлов Цикл
		Описание = Новый ОписаниеПередаваемогоФайла(СтрокаФайл.ПолноеИмяФайла, "");
		ПомещаемыеФайлы.Добавить(Описание);
	КонецЦикла;
		
	ПомещенныеФайлы = Новый Массив;
	Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь) Тогда
		
		Для каждого Файл Из ПомещенныеФайлы Цикл
			СписокЗагруженныхФайлов.Добавить(Файл);
		КонецЦикла;
		
		Закрыть(Истина);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Файлы не загружены'", "ru");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	

КонецПроцедуры




//======================================================================================================
