#Область ПроведениеДокумета

Процедура ОбработкаПроведения(Отказ, Режим)
	
	лМасса = 0;
	// регистр сжсвРационы
	Движения.сжсвКормосмеси.Записывать = Истина;
	Для Каждого ТекСтрокаКорма Из Корма Цикл
		Движение = Движения.сжсвКормосмеси.Добавить();
		Движение.Период = Дата;
		Движение.Кормосмесь = Кормосмесь;
		Движение.Корм = ТекСтрокаКорма.Корм;
		Движение.Количество = ТекСтрокаКорма.Количество;
		
		лМасса = лМасса + ТекСтрокаКорма.Количество;
		
	КонецЦикла;
	
	// регистр сжсвНормыРасходаНоменклатуры
	
	Движения.сжсвНормыРасходаНоменклатуры.Записывать = Истина;
	Движение = Движения.сжсвНормыРасходаНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Кормосмесь = Кормосмесь;
	Движение.Количество = лМасса;
	
КонецПроцедуры

#КонецОбласти