&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ТабДок = Обработки.ЗагрузкаГеновТомата.ПолучитьМакет("Макет");
	
	СчСтрок = 1;
	
	Пока Истина Цикл
		
		Если ПустаяСтрока(ТабДок.Область(СчСтрок,1).Текст) Тогда
			Прервать;
		КонецЕсли;
		
		НовыйОбъект = Справочники.СписокГеновТомата.СоздатьЭлемент();
		НовыйОбъект.Наименование = ТабДок.Область(СчСтрок,1).Текст;
		НовыйОбъект.GeneName= ТабДок.Область(СчСтрок,2).Текст;
		НовыйОбъект.Allele= ТабДок.Область(СчСтрок,3).Текст;
	    НовыйОбъект.AlleleName= ТабДок.Область(СчСтрок,4).Текст;
	    НовыйОбъект.Synonyms = ТабДок.Область(СчСтрок,5).Текст;
		НовыйОбъект.Phenotype= ТабДок.Область(СчСтрок,6).Текст;
		НовыйОбъект.Notes= ТабДок.Область(СчСтрок,7).Текст;
		НовыйОбъект.About= ТабДок.Область(СчСтрок,9).Текст;
			     	
		НовыйОбъект.Записать();
		
		СчСтрок = СчСтрок + 1;
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура загрузить(Команда)
	ЗагрузитьНаСервере();

КонецПроцедуры
