#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	ПредставлениеДаты = Формат (Дата, "ДФ=гггг");
	
	// Установка отбора
	Календарь.Отбор.Элементы.Очистить();
	ЭлементОтбора = Календарь.Отбор.Элементы.Добавить(Тип ("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ("Год");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = НачалоГода (Дата);
	ЭлементОтбора.Использование = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборНедельСупоросности();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДатыРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	если ЗначениеЗаполнено(Дата) тогда
		Дата = ДобавитьМесяц(Дата, (12 * Направление));
		ПредставлениеДаты = Формат (Дата, "ДФ=гггг");
		
		// Установка отбора
		Календарь.Отбор.Элементы.Очистить();
		ЭлементОтбора = Календарь.Отбор.Элементы.Добавить(Тип ("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ("Год");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = НачалоГода (Дата);
		ЭлементОтбора.Использование = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	если НЕ ЗначениеЗаполнено(Дата) тогда
		ТекстСообщения = "Не указан период заполнения";
		ОбщегоНазначенияСервер.СообщитьПользователю(ТекстСообщения);
	иначе
		ЗаполнитьКалендарь(Дата);
		Элементы.Календарь.Обновить();	
		Элементы.КалендарьСупоросность.Обновить();
	КонецЕсли;
	
	УстановитьОтборНедельСупоросности();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьКалендарь(Дата)
	
	ДатаНачалоГода = НачалоГода (Дата);
	если ДеньНедели(НачалоГода (Дата)) >= 5 тогда
		НачалоГода = КонецНедели(НачалоГода (Дата)) + 1;	// Неделя относится к предыдущему году
	иначе
		НачалоГода = НачалоНедели(НачалоГода (Дата));		// Неделя относится к текущему году
	КонецЕсли;
	
	если ДеньНедели(КонецГода (Дата)) <= 3 тогда	
		КонецГода = НачалоДня (НачалоНедели(КонецГода (Дата))-1);	// Неделя относится к следующему году
	иначе
		КонецГода = НачалоДня (КонецНедели(КонецГода (Дата)));		// Неделя относится к текущему году
	КонецЕсли;
	
	НомерНедели = 1;
	ДатаТек = НачалоГода;
	
	пока ДатаТек <= КонецГода цикл
		ЗаписатьДанныеВКалендарь (ДатаТек, НомерНедели, ДатаНачалоГода);
		если ДеньНедели(ДатаТек) = 7 тогда
			НомерНедели = НомерНедели + 1;
		КонецЕсли;
		ДатаТек = КонецДня (ДатаТек) + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеВКалендарь (ДатаГода, НомерНедели, Год)
	
	МенеджерЗаписи = РегистрыСведений.сжсвПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ДатаГода;
	МенеджерЗаписи.НомерНедели = НомерНедели;
	МенеджерЗаписи.Год = Год;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.сжсвПроизводственныйКалендарьСупоросность.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерНедели = НомерНедели;
	МенеджерЗаписи.Дата = ДатаГода;
	МенеджерЗаписи.НомерНеделиСупоросности = 1;
	МенеджерЗаписи.Год = Год;
	МенеджерЗаписи.Записать();
		
	для сч = 1 по 20 цикл
		МенеджерЗаписи = РегистрыСведений.сжсвПроизводственныйКалендарьСупоросность.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НомерНедели = НомерНедели;
		МенеджерЗаписи.Дата = ДатаГода + (86400 * 7 * сч);
		МенеджерЗаписи.НомерНеделиСупоросности = сч;
		МенеджерЗаписи.Год = Год;
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборНедельСупоросности();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНедельСупоросности()
	
	КалендарьСупоросность.Отбор.Элементы.Очистить();
	ТекДан = Элементы.Календарь.ТекущиеДанные;
	если НЕ ТекДан = Неопределено тогда
		ЭлементОтбора = КалендарьСупоросность.Отбор.Элементы.Добавить(Тип ("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ("НомерНедели");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекДан.НомерНедели;
		ЭлементОтбора.Использование = истина;
		
		ЭлементОтбора = КалендарьСупоросность.Отбор.Элементы.Добавить(Тип ("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ("Год");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = НачалоГода (Дата);
		ЭлементОтбора.Использование = истина;
	иначе
		ЭлементОтбора = КалендарьСупоросность.Отбор.Элементы.Добавить(Тип ("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ("Год");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = НачалоГода (Дата);
		ЭлементОтбора.Использование = истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти









