#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПризнакиБолезниОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПризнакиБолезни.Добавить();
			НоваяСтрока.Признак = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоражаемыеСистемыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПоражаемыеСистемы.Добавить();
			НоваяСтрока.ПоражаемаяСистема = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВозбудителиБолезниОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ВозбудителиБолезни.Добавить();
			НоваяСтрока.Возбудитель = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносчикиБолезниОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПереносчикиБолезни.Добавить();
			НоваяСтрока.Переносчик = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВетПрепаратовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПрименениеВетПрепаратов.Добавить();
			НоваяСтрока.ВетеринарныйПрепарат = Значение.Ссылка;
			НоваяСтрока.ЕдиницаИзмерения = ВернутьЕдиницуХраненияМатериала (Значение.Ссылка) 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВетеринарныеМероприятияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ВетеринарныеМероприятия.Добавить();
			НоваяСтрока.ВетеринарноеМероприятие = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛитератураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Литература.Добавить();
			НоваяСтрока.Литература = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВетПрепаратовВетеринарныйПрепаратПриИзменении(Элемент)
		ТекДан = ЭтотОбъект.Элементы.ПрименениеВетПрепаратов.ТекущиеДанные;
	если ЗначениеЗаполнено (ТекДан.ВетеринарныйПрепарат) тогда
		ТекДан.ЕдиницаИзмерения = ВернутьЕдиницуХраненияМатериала (ТекДан.ВетеринарныйПрепарат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьЕдиницуХраненияМатериала (ВетеринарныйПрепарат)
	
	Возврат (ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ВетеринарныйПрепарат, "ЕдиницаХраненияОстатков"));	
	
КонецФункции

#КонецОбласти

#Область Подбора

&НаКлиенте
Процедура ПодборСистем(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ПоражаемыеСистемы", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.сжсвЗаболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПоражаемыеСистемы);
КонецПроцедуры

&НаКлиенте
Процедура ПодборВетПрепаратов(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПрименениеВетПрепаратов);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПризнаковБолезни(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ПризнакиБолезни", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПризнакиБолезни);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВозбудителей(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ВозбудителиБолезни", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ВозбудителиБолезни);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПереносчиков(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ПереносчикиБолезни", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПереносчикиБолезни);
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛитературы(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"Литература", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.Литература);
КонецПроцедуры

&НаКлиенте
Процедура ПодборВетеринарныхМероприятий(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ВетеринарныеМероприятия", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ВетеринарныеМероприятия);
КонецПроцедуры

#КонецОбласти