#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСинонимВладельца_Сервер();
		
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьСинонимВладельца_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	если НЕ ЗначениеЗаполнено(Объект.Наименование)
			И ЗначениеЗаполнено(Объект.ЕдиницаПоКлассификатору) тогда
		Объект.Наименование = ВернутьНаименованиеЕдИзм(Объект.ЕдиницаПоКлассификатору);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСинонимВладельца_Сервер()
	
	если НЕ ЗначениеЗаполнено(Объект.Владелец) тогда
		Возврат;
	иначе
		если ТипЗнч (Объект.Владелец) = Тип ("СправочникСсылка.Препараты") тогда
			ВладелецЗаголовок = "Ветеринарный препарат";
		иначеЕсли ТипЗнч (Объект.Владелец) = Тип ("СправочникСсылка.Удобрения") тогда
			ВладелецЗаголовок = "Корм";
		КонецЕсли;
		ЭтотОбъект.Элементы.Владелец.Заголовок = ВладелецЗаголовок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСинонимВладельца_Клиент()
	
	если НЕ ЗначениеЗаполнено(Объект.Владелец) тогда
		Возврат;
	иначе
		если ТипЗнч (Объект.Владелец) = Тип ("СправочникСсылка.Препараты") тогда
			ВладелецЗаголовок = "Ветеринарный препарат";
		иначеЕсли ТипЗнч (Объект.Владелец) = Тип ("СправочникСсылка.Удобрения") тогда
			ВладелецЗаголовок = "Корм";
		КонецЕсли;
		ЭтотОбъект.Элементы.Владелец.Заголовок = ВладелецЗаголовок;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьНаименованиеЕдИзм (ЕдИзмСсылка)
	
	Возврат (ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ЕдИзмСсылка, "Наименование"));
	
КонецФункции

#КонецОбласти