	&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
 Если ОтображатьКартинку Тогда
        АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Изображение");
	   
 КонецЕсли;

КонецПроцедуры
             &НаКлиенте
Процедура ОтображатьКартинкиПриИзменении(Элемент)
Если ОтображатьКартинку Тогда
        АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Изображение");
        Элементы.АдресКартинки.Видимость = Истина;
	   
	
Иначе
        Элементы.АдресКартинки.Видимость = Ложь;
	    
	
КонецЕсли;
	
	
КонецПроцедуры
