//ПоказатьоповещениеПользователя("Итак, Приступим!");
//Сегодня=ТекущаяДата();
//Если ДеньНедели(Сегодня)=1 Тогда
//	Сообщить ("Храбрость заменяет стены");
//	ИначеЕсли  ДеньНедели(Сегодня)=2 Тогда
//    Сообщить ("Ценно то, что редко.");
//    ИначеЕсли  ДеньНедели(Сегодня)=3 Тогда
//    Сообщить ("Познай самого себя.");
//    ИначеЕсли  ДеньНедели(Сегодня)=4 Тогда
//    Сообщить ("Когда двое ссорятся, третий радуется.");
//    ИначеЕсли  ДеньНедели(Сегодня)=5 Тогда
//    Сообщить ("Голод — учитель искусств.");
//	ИначеЕсли  ДеньНедели(Сегодня)=6 Тогда
//    Сообщить ("У счастья много друзей.");
//	ИначеЕсли  ДеньНедели(Сегодня)=7 Тогда
//    Сообщить ("Великому духом подобает большое счастье.");
//КонецЕсли; 
//Сообщить(ДеньНедели(Сегодня));
