
&НаКлиенте
Процедура Команда1(Команда)
	Объект.HTML = Адрес;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.HTML.Назад();	
КонецПроцедуры


&НаКлиенте
Процедура АдресОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Объект.HTML = Текст; Адрес = Текст; 
КонецПроцедуры


&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	Адрес = Элемент.Документ.url;
КонецПроцедуры


&НаКлиенте
Процедура ГИС(Команда)
	Объект.HTML = ("https://www.gismeteo.ru/weather-sauk-dere-155864/3-days/") ;
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументЗакладка1(Элемент)
	Адрес = ("https://www.gismeteo.ru/weather-sauk-dere-155864/3-days/");
КонецПроцедуры

&НаКлиенте
Процедура яндекс(Команда)
	Объект.HTML = ("https://yandex.ru/pogoda/145957");
КонецПроцедуры
&НаКлиенте
Процедура HTMLДокументЗакладка(Элемент)
	Адрес = ("https://yandex.ru/pogoda/145957");
КонецПроцедуры