
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Не Элемент.ТекущаяСтрока=Неопределено Тогда
		АдресКартинки =ОбщиеСервер.ПолучитьДанныеКартинки(Элемент.ТекущаяСтрока,УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ПараметрыПеретаскивания.Значение=Элемент.ТекущиеДанные.Ссылка;
КонецПроцедуры
                                                                                     