#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	если НЕ ЗначениеЗаполнено(Объект.ПолноеНаименование) тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаХраненияОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	если Объект.Ссылка.Пустая() И НЕ Записать() тогда
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаДляОтчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	если Объект.Ссылка.Пустая() И НЕ Записать() тогда
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
