//имволы: 

// 

//[  -Alt+91 

//] -Alt+93 

//< -Alt+60 

//= -Alt+61 

//>-Alt+62 

//& -Alt+38    амперсанд 

//# -Alt+35 

//| -Alt+124 

//♂ -Alt+267 или  Alt+11 

//♀ -Alt+268 или  Alt+12  

//☺ - Alt+1 

// 

//Windows: 

// 

//Win+V – множественный выбор 

//Shift + правая кнопка мыши – копировать как путь 

// 

//Основные команды: 
// 
//Кодирование: 
//Ctrl+Пробел - вызов подсказки 
//Ctrl+Q - вызов шаблона 
//Ctrl+F1 - поиск в синтакс-помощнике 
//Ctrl + L - удалить текущую строку 
//Alt+Shift+F - отформатировать код 
//Исследование: 
//F12 - ставим курсор на процедуре или функции и переходим к определению процедуры или функций. 
//Ctrl+(минус) - перемещает назад в модуль, из которого ушли через F12 
//Ctrl+T - найти в дереве конфигурации 
//Ctrl+F - найти объект метаданных или его реквизит в дереве метаданных. 
//Отладка: 
//F5 - начать/продолжить отладку 
//F9 - установить/снять точку останова 
//F10 - шагнуть через процедуру или функцию, на следующую строку кода 
//F11 - идти по порядку с заходом во все процедуры и функции. 
//Alt+F9 - список точек останова 
//Shift+F9 - вычислить выражение 
//Ctrl+Shift+F9 - отк./вкл. точку остан. 
//Ctrl+Alt+W - открыть табло 
//Ctrl+Alt+C - открыть стек вызовов 
//Закладки: 
//Alt+F2 - установить/снять закладку 
//F2 - к следующей закладке 
//Shift+F2 - к предыдущей закладке 
//Быстрый переход по Процедурам, Функциям, Условиям, Циклам: 
//Ctrl+[ - перейти назад 
//Ctrl+] - перейти вперед 
//Ctlr+G - перемещения к строке кода 
//Окно сообщений: 
//Ctrl+Alt+Z - очистить. 
//Ctrl+Shift+Z - очистить и закрыть 

//Ctrl + Alt + W - Открыть табло 