///////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АдресКартинки =ОбщиеСервер.ПолучитьДанныеКартинки(Объект.Ссылка,УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		ОбщиеСервер.ПолучитьСписокСкладов(Склад,Объект.Ссылка);
		МестоХранения=Склад;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	АдресКартинки=ОбщиеКлиент.ВопросОбИзмененииКартинки(Объект,АдресКартинки,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПоискДаташитаНажатие(Элемент)
	 ОткрытьФормуМодально("Обработка.ПоискДаташитов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияПриложениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДанныеФайла = ПолучитьДанныеФайла(ЭтаФорма.Элементы.Приложения.ТекущиеДанные.Приложение);
		ТекущийФайл=ОбщиеКлиент.ОткрытьФайл(ДанныеФайла,Объект.Ссылка); 
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьДанныеФайла(ФайлПриложения)
	Возврат ОбщиеСервер.ПолучитьДанныеФайла(ФайлПриложения.Ссылка,УникальныйИдентификатор);
КонецФункции


&НаКлиенте
Процедура МестоХраненияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Склад);
	ОткрытьФорму("Справочник.МестаХранения.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

