
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РЕЕСТР_Коллекция.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЕЕСТР_Коллекция.весПлода,
	|	РЕЕСТР_Коллекция.ВыборГенов,
	|	РЕЕСТР_Коллекция.Год,
	|	РЕЕСТР_Коллекция.Дата,
	|	РЕЕСТР_Коллекция.КартинкаQRКода,
	|	РЕЕСТР_Коллекция.НазваниеТомата,
	|	РЕЕСТР_Коллекция.Номер,
	|	РЕЕСТР_Коллекция.Окраска,
	|	РЕЕСТР_Коллекция.Описание,
	|	РЕЕСТР_Коллекция.Отбор,
	|	РЕЕСТР_Коллекция.Посев,
	|	РЕЕСТР_Коллекция.Пятно,
	|	РЕЕСТР_Коллекция.РегистрационныйНомер,
	|	РЕЕСТР_Коллекция.СеменаОкраска,
	|	РЕЕСТР_Коллекция.СеменаОпушение,
	|	РЕЕСТР_Коллекция.Сеянец,
	|	РЕЕСТР_Коллекция.СилаРоста,
	|	РЕЕСТР_Коллекция.Сочленение,
	|	РЕЕСТР_Коллекция.ТипРоста,
	|	РЕЕСТР_Коллекция.ТипТекста,
	|	РЕЕСТР_Коллекция.ТипТомата,
	|	РЕЕСТР_Коллекция.ФормаПлода,
	|	РЕЕСТР_Коллекция.Фото,
	|	РЕЕСТР_Коллекция.ЦветокОкраска,
	|	РЕЕСТР_Коллекция.ТаблицаГенов.(
	|		Gene,
	|		GeneName
	|	)
	|ИЗ
	|	Документ.РЕЕСТР_Коллекция КАК РЕЕСТР_Коллекция
	|ГДЕ
	|	РЕЕСТР_Коллекция.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаГеновШапка = Макет.ПолучитьОбласть("ТаблицаГеновШапка");
	ОбластьТаблицаГенов = Макет.ПолучитьОбласть("ТаблицаГенов");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаГеновШапка);
		ВыборкаТаблицаГенов = Выборка.ТаблицаГенов.Выбрать();
		Пока ВыборкаТаблицаГенов.Следующий() Цикл
			ОбластьТаблицаГенов.Параметры.Заполнить(ВыборкаТаблицаГенов);
			ТабДок.Вывести(ОбластьТаблицаГенов, ВыборкаТаблицаГенов.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
