#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Первоначальное заполнение нового объекта
	если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ОбщегоНазначенияСервер.ПервоначальноеЗаполнениеДокумента(ДокОбъект);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КормаКормПриИзменении(Элемент)
	
	ТекДан = Элементы.Корма.ТекущиеДанные;
	если ЗначениеЗаполнено(ТекДан.Корм) тогда
		Данные = ПолучитьДанныеПоМатериалу (ТекДан.Корм, ТекДан.Количество);
		ТекДан.ЕдиницаИзмерения = Данные.ЕдИзм;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоМатериалу (Материал, Количество)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Справочник.ЕдиницаХраненияОстатков КАК ЕдИзм,
				   |	Справочник.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	Справочник." + ?(ТипЗнч(Материал) = Тип ("СправочникСсылка.сжсвКорма"), "сжсвКорма", "сжсвВетеринарныеПрепараты") + 
				   " КАК Справочник
	               |ГДЕ
	               |	Справочник.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Материал);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ЕдИзм", Выборка.ЕдИзм);
	
	Возврат (Результат);
	
КонецФункции

#КонецОбласти