
//&НаКлиенте
//Процедура ТаблицаГеновПриИзменении(Элемент)
//	СтрокаТабличнойЧасти = Элементы.ТаблицаГенов.ТекущиеДанные;
//	СтрокаТабличнойЧасти.Gene = Справочники.СписокГеновТомата.ПолучитьФормуВыбора();
//КонецПроцедуры






//&НаКлиенте
//Процедура ТаблицаГеновGeneПриИзменении(Элемент)
//	ТекущиеДанные = Элементы.ТаблицаГенов.ТекущиеДанные;
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаГеновGeneНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ПараметрыОткрытия = Новый Структура;
//	ПараметрыОткрытия.Вставить("GENE",Истина)
//КонецПроцедуры
