Процедура ВыполнитьДействие() Экспорт
	
	
КонецПроцедуры

ТекстЗапросаПостроителя = "ВЫБРАТЬ
                          |	Номенклатура.Ссылка КАК Номенклатура,
                          |	Номенклатура.ЦеноваяГруппа,
                          |	Номенклатура.ОсновнойПоставщик,
                          |	Номенклатура.ПометкаУдаления
                          |ИЗ
                          |	Справочник.Номенклатура КАК Номенклатура
                          |ГДЕ
                          |	Номенклатура.ЭтоГруппа = ЛОЖЬ";
						  
Построитель.Текст = ТекстЗапросаПостроителя;

Построитель.ЗаполнитьНастройки();

Построитель.Отбор.Добавить("Номенклатура",		"Номенклатура");
Построитель.Отбор.Добавить("ЦеноваяГруппа",		"ЦеноваяГруппа");
Построитель.Отбор.Добавить("ОсновнойПоставщик",	"ОсновнойПоставщик");
Построитель.Отбор.Добавить("ПометкаУдаления",	"ПометкаУдаления");

