Функция мКомпонента_QR_Код_Получить( лОтказ )
	лМакет_Компонента = ПолучитьМакет( "_Компонента_QR_Код" );
	лАдрес = ПоместитьВоВременноеХранилище( лМакет_Компонента );
	Попытка
		Если ПодключитьВнешнююКомпоненту( лАдрес, "QR" ) Тогда
			лQR_Code_Generator = Новый( "AddIn.QR.QRCodeExtension" );
		Иначе
			Сообщить( "Ошибка" );
			лОтказ = Истина;
		КонецЕсли
	Исключение
		Сообщить( ОписаниеОшибки() );
		лОтказ = Истина;
	КонецПопытки;
	
	Возврат лQR_Code_Generator;
КонецФункции

Функция _QR_Код_Получить( пТекст, пУровень_Коррекции, пРазмер_Пикселей, пФайл_Имя_Полное = Неопределено ) Экспорт
	лОтказ = Ложь;
	лКомпонента_QR_Код = мКомпонента_QR_Код_Получить( лОтказ );
	Если лОтказ = Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		лДвоичные_Данные_Картинка = лКомпонента_QR_Код.GenerateQRCode( пТекст, пУровень_Коррекции, пРазмер_Пикселей );
	Исключение
		Сообщить( "Ошибка при генерации QR-кода: " + ОписаниеОшибки() );
		Возврат Ложь;
	КонецПопытки;

	Если ЗначениеЗаполнено( пФайл_Имя_Полное ) Тогда
		лДвоичные_Данные_Картинка.Записать( пФайл_Имя_Полное );
		Сообщить( "Записан файл: <" + пФайл_Имя_Полное + ">" );
	КонецЕсли;
	
	Возврат лДвоичные_Данные_Картинка;
КонецФункции

Функция СведенияОВнешнейОбработке() Экспорт
    лДополнительныеОтчетыИОбработки = Вычислить( "ДополнительныеОтчетыИОбработки" );
    ПараметрыРегистрации = лДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
    
    лДополнительныеОтчетыИОбработкиКлиентСервер = Вычислить( "ДополнительныеОтчетыИОбработкиКлиентСервер" );
    ПараметрыРегистрации.Вид = лДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
    ПараметрыРегистрации.Версия = "1.0";
    
    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = "Генерация QR-кода (ts56.ru)";
    НоваяКоманда.Идентификатор = "_ts56_ru_Генерация_QR_Кода";
    НоваяКоманда.Использование = лДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;
    
    Возврат ПараметрыРегистрации;
    
КонецФункции
