#Область ПроверкиПередЗаписью

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа И НЕ ОбменДанными.Загрузка Тогда
		Если Не ЭтоНовый() Тогда
			Если Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ОбщегоНазначенияСервер.Номенклатура_СуществуютСсылки(Ссылка) Тогда
				ТекстСообщения = "Единица """ + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + """ является единицей использования для """ + Наименование + 
								 """ и уже участвует в товародвижении. Изменить данную единицу нельзя!";
				Поле = "ЕдиницаХраненияОстатков";
				ОбщегоНазначенияСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле);
				Отказ = истина;
			иначеЕсли ЗначениеЗаполнено(ЕдиницаХраненияОстатков) тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЕдиницыИзмерения.Представление КАК ЕдиницаПредставление,
				               |	ЕдиницыИзмерения.Коэффициент
				               |ИЗ
				               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
				               |ГДЕ
				               |	ЕдиницыИзмерения.Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", ЕдиницаХраненияОстатков);
				Выборка = Запрос.Выполнить().Выбрать();
				Выборка.Следующий();
				если НЕ Выборка.Коэффициент = 1 тогда
					ТекстСообщения = "Коэффициент единицы использования " + Выборка.ЕдиницаПредставление + " должен быть равен 1";
					Поле = "ЕдиницаХраненияОстатков";
					ОбщегоНазначенияСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле);
					Отказ = истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
