#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКратности();
	Если ПолучитьЗначениеФункцОпцииРасширУчетВетПрепаратов() тогда
	ОбщегоНазначенияКлиентСервер.ВыборПрепарата(Объект,Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособСписанияПриИзменении(Элемент)
	
	УстановитьВидимостьКратности();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	если НЕ ЗначениеЗаполнено(Объект.ПолноеНаименование) тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаХраненияОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	если Объект.Ссылка.Пустая() И НЕ Записать() тогда
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаДляОтчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	если Объект.Ссылка.Пустая() И НЕ Записать() тогда
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияЗаказаПриИзменении(Элемент)
	УстановитьВидимостьКратности();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер; 
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПриИзменении(Элемент)
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	Парам = Новый Структура("Владелец", объект.ссылка);
	ОткрытьФорму("Справочник.новФайлы.Форма.ФормаВыбора",Парам, Элемент);

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеФункцОпцииРасширУчетВетПрепаратов()
	
Возврат ПолучитьФункциональнуюОпцию("ВестиРасширенныйУчетВетПрепаратов");

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКратности()
	
	Если Объект.СпособСписания = ПредопределенноеЗначение("Перечисление.сжсвМетодыРаспределенияМатериалов.ПоМассе") Тогда
		Элементы.ГруппаКратность.Видимость = Истина;
	Иначе
		Элементы.ГруппаКратность.Видимость = Ложь;
	КонецЕсли;
	
		Если Объект.СпособРаспределенияЗаказа = ПредопределенноеЗначение("Перечисление.сжсвМетодыРаспределенияВетПрепарата.ПоМассе") Тогда
		Элементы.ГруппаНормаКратность.Видимость = Истина;
		Элементы.ГруппаКратностьНорма.Видимость = Истина;
		Элементы.ГруппаТочекЗаказа.Видимость=Ложь;
	ИначеЕсли Объект.СпособРаспределенияЗаказа = ПредопределенноеЗначение("Перечисление.сжсвМетодыРаспределенияВетПрепарата.ПоГоловам") Тогда
		Элементы.ГруппаКратностьНорма.Видимость = Истина;
		Элементы.ГруппаНормаКратность.Видимость = Ложь;
		Элементы.ГруппаТочекЗаказа.Видимость=Ложь;
	Иначе 
		Элементы.ГруппаКратностьНорма.Видимость = Ложь;
		Элементы.ГруппаТочекЗаказа.Видимость=Истина;
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти