
&НаКлиенте
Процедура ОткрытьСодержимое(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДанныеФайла = ОбщиеСервер.ПолучитьДанныеФайла(Объект.Ссылка,УникальныйИдентификатор);
		ТекущийФайл=ОбщиеКлиент.ОткрытьФайл(ДанныеФайла,Объект.Ссылка); 
		Файл = Новый Файл(ТекущийФайл);
		Если Файл.Существует() Тогда
			Если Не ДанныеФайла.Размер=Файл.Размер() Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("Переписать файл в базе?", Режим, 0);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Объект.Размер=Файл.Размер();
					Записать();
					ПолноеИмяФайла = Файл.ПолноеИмя;
					ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
					ОбщиеСервер.ЗаписатьФайлВРегистр(Объект.Ссылка, ДвоичныеДанные);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ВременныйФайл=ОбщиеКлиент.ДобавитьФайлПроекта(УникальныйИдентификатор);
	Если Не ВременныйФайл=Неопределено Тогда
		Объект.Размер=ВременныйФайл.Размер;
		Объект.ДатаСоздания=ВременныйФайл.ВремяИзменения;
		Объект.Расширение		= ВременныйФайл.РасширениеБезТочки;
		Если  ПустаяСтрока(Объект.Наименование) Тогда
			Объект.Наименование		= ВременныйФайл.ИмяБезРасширения;
		КонецЕсли;
		Записать();
		ОбщиеСервер.ЗаписатьФайлВРегистр(Объект.Ссылка, ВременныйФайл.ДвоичныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АдресКартинки =ОбщиеСервер.ПолучитьДанныеКартинки(Объект.Ссылка,УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	АдресКартинки=ОбщиеКлиент.ВопросОбИзмененииКартинки(Объект,АдресКартинки,УникальныйИдентификатор);

КонецПроцедуры
