#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Список.Параметры.УстановитьЗначениеПараметра("ДатаДокумента", Параметры.ДатаДокумента);	

	Заболевание = Параметры.Заболевание;
	Возбудитель = Параметры.Возбудитель;
	
	Список.Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(Заболевание) ИЛИ ЗначениеЗаполнено(Возбудитель) Тогда
	
		Если ЗначениеЗаполнено(Заболевание) Тогда
			Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заболевание");
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.ПравоеЗначение = Заболевание;
			Отбор.Использование = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Возбудитель) Тогда
			ОтборВ = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборВ.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Возбудитель");
			ОтборВ.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборВ.ПравоеЗначение = Возбудитель;
			ОтборВ.Использование = Истина;
		КонецЕсли;
		УстановленОтбор = Истина;
		
	КонецЕсли;
	
	УстановитьВидимостьОтбора();
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьОтбора()
	
	Если УстановленОтбор Тогда
		Элементы.ФормаСнятьОтбор.Доступность = Истина;
	Иначе
		Элементы.ФормаСнятьОтбор.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтбор(Команда)
	
	Список.Отбор.Элементы.Очистить();
	УстановленОтбор = Ложь;
	УстановитьВидимостьОтбора();
	
КонецПроцедуры

#КонецОбласти

