#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Первоначальное заполнение нового объекта
	если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ОбщегоНазначенияСервер.ПервоначальноеЗаполнениеДокумента(ДокОбъект);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	КонецЕсли;
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура ("Ферма", Объект.Ферма));
	
КонецПроцедуры

&НаКлиенте
Процедура ФермаПриИзменении(Элемент)
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура ("Ферма", Объект.Ферма));
	
КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиСвиноматкаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвСвиноматки", Текст, Объект.Дата, Объект.Ферма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиСвиноматкаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвСвиноматки", Текст, Объект.Дата, Объект.Ферма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиХрякАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвХряки", Текст, Объект.Дата, Объект.Ферма);

КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиХрякОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвХряки", Текст, Объект.Дата, Объект.Ферма);

КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиХряк2АвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвХряки", Текст, Объект.Дата, Объект.Ферма);

КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиХряк2ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвХряки", Текст, Объект.Дата, Объект.Ферма);

КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиХряк3АвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвХряки", Текст, Объект.Дата, Объект.Ферма);

КонецПроцедуры

&НаКлиенте
Процедура СвиноматкиХряк3ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ОбщегоНазначенияСервер.ПолучитьДанныеВыбораЖивотного("сжсвХряки", Текст, Объект.Дата, Объект.Ферма);

КонецПроцедуры

#КонецОбласти

#Область Подбор

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресВХранилище = ПоместитьВХранилище_ГруппыСостояние();
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Ферма", Объект.Ферма);
	ПараметрыПодбора.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыПодбора.Вставить("СвиноматокСостояниеГруппа",АдресВХранилище);
	
	ФормаПодбора = ОткрытьФорму("Обработка.сжсвПодборВДокументы.Форма.Форма_УРЦ", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилище_ГруппыСостояние()
	МассивГруппы = Новый Массив;
	МассивГруппы.Добавить(Перечисления.сжсвГруппыЖивотных.РемонтныеСвинки);
	МассивГруппы.Добавить(Перечисления.сжсвГруппыЖивотных.ПроверяемыеСвиноматки);
	МассивГруппы.Добавить(Перечисления.сжсвГруппыЖивотных.ОсновныеСвиноматки);
	
	МассивСостояние = Новый Массив;
	МассивСостояние.Добавить(Перечисления.сжсвСостоянияСвиноматки.Холостая);
	МассивСостояние.Добавить(Перечисления.сжсвСостоянияСвиноматки.УсловноСупоросная);
	МассивСостояние.Добавить(Перечисления.сжсвСостоянияСвиноматки.Супоросная);
	
	ГруппыСостояние = Новый Структура;
	ГруппыСостояние.Вставить("СвиноматокГруппа",МассивГруппы);
	ГруппыСостояние.Вставить("СвиноматокСостояние",МассивСостояние);
	
	Возврат ПоместитьВоВременноеХранилище(ГруппыСостояние, УникальныйИдентификатор);
КонецФункции

// Заносит в документ информацию, введенную в форме подбора
//
// Параметры
//	Адрес - адрес временного хранилища, в котором хранятся введенные данные
&НаКлиенте
Процедура ОбработатьПодбор(Адрес) Экспорт
	
	ДобавитьЗначенияВТаблЧастьФормы(Адрес);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначенияВТаблЧастьФормы(АдресВХранилище)
	
	Данные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	для каждого ЭлементДанные из Данные цикл
		ТекущаяСтрока = Объект.Свиноматки.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ЭлементДанные); 		
	конеццикла;
	
КонецПроцедуры

#КонецОбласти

