#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Отображение картинки при открытии формы справочника.
	Фото = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
	
	// Устанавливаем автомасштаб для картинки.
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиентСервер.ВыборТипаФайла(Объект,Отказ);
	Если Не Объект.ТипФайла = ПредопределенноеЗначение("Перечисление.сжсвТипыФайлов.Картинка") тогда
		Элементы.Фото.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ПолноеНаименование="" тогда
		ДобавитьКартинку();
	иначе
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	МойФайл = Новый Файл(Объект.ПутьКФайлу);	
	Если НЕ МойФайл.Существует() Тогда                      
		Предупреждение("Неверно задан путь к файлу!");
	иначе
		ЗапуститьПриложение(Объект.ПутьКФайлу);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку(ИмяЗагружаемогоФайла, ИмяФайла)
	
	Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Объект.Наименование = ИмяЗагружаемогоФайла;
	Объект.ПолноеНаименование = ИмяЗагружаемогоФайла;
	Объект.ПутьКФайлу = ИмяФайла;
	Фото = ПоместитьВоВременноеХранилище(Файл.Получить());
	
	ЭтоОбъект = РеквизитФормыВЗначение("Объект");
	ЭтоОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	ЭтоОбъект.Записать();
	Модифицированность = Ложь;
	ЗначениеВРеквизитФормы(ЭтоОбъект, "Объект")
	
	//Если Объект.Картинка.Пустая() = Ложь и Объект.Картинка.ПолучитьОбъект()<>Неопределено Тогда
	//	
	//СтарыйФайлКартинки = Объект.Картинка.ПолучитьОбъект();
	//СтарыйФайлКартинки.Удалить();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку()
	
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина)= Истина Тогда
		Файл = Новый Файл (ИмяФайла);
		ИмяЗагружаемогоФайла = Файл.Имя;
		Фото = ПутьФайла;
		УстановитьКартинку(ИмяЗагружаемогоФайла, ИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлИСохранитьНаДиск()
	СсылкаНаФайл = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
	ПолучитьФайл(СсылкаНаФайл, Объект.ПутьКФайлу, Истина);
КонецПроцедуры

#КонецОбласти
