
//&НаКлиенте
//Процедура СписокПриАктивизацииСтроки(Элемент)Экспорт
// Если ОтображатьКартинки Тогда
//        АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Изображение");
//    КонецЕсли;

//КонецПроцедуры
//&НаКлиенте
//Процедура ОтображатьКартинкиПриИзменении(Элемент)Экспорт
//Если ОтображатьКартинки Тогда
//        АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Изображение");
//        Элементы.АдресКартинки.Видимость = Истина;
//    Иначе
//        Элементы.АдресКартинки.Видимость = Ложь;
//    КонецЕсли;
//	     
//КонецПроцедуры
//&НаКлиенте
//Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)Экспорт
//	Оповещение = Новый ОписаниеОповещения ("АдресКартинкиНажатиеЗавершение",ЭтотОбъект);
//	
//	НачатьпомещениеФайла (Оповещение,,,Истина,УникальныйИдентификатор);
//	СтандартнаяОбработка = Ложь;
//КонецПроцедуры
//Процедура АдресКартинкиНажатиеЗавершение (Результат,Адрес, ПомещаемыйФайл, ДополнительныеПараметры)Экспорт
//	
//Если НЕ Результат Тогда
//Возврат;
//	
//КонецЕсли;
//АдресКартинки = Адрес;
//Модифицируемость = Истина;
//	
//конецПроцедуры
//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)Экспорт
//Если ЭтоАдресВременногоХранилища (АдресКартинки) Тогда
//ТекущийОбъект.Изображение = Новый ХранилищеЗначения (ПолучитьИзВременногоХранилища(АдресКартинки));
//КонецЕсли;

//Если ПустаяСтрока (АдресКартинки) Тогда
//	 ТекущийОбъект.Изображение = Неопределено;
//	КонецЕсли;
//КонецПроцедуры
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)Экспорт
//	АдресКартинки  = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Изображение"); 
//КонецПроцедуры


