
// ПРОЦЕДУРЫ ФОРМЫ
//======================================================================================================
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
			Объект.Наименование = ".";
	КонецЕсли;
		
	Если НЕ Параметры.Ключ.Пустая() Тогда
	   ДанныеАдрес = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеХЗ");
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ДанныеАдрес) Тогда
		
		РежимСжатия              = Новый СжатиеДанных(9);
		ДанныеСохранения         = ПолучитьИзВременногоХранилища(ДанныеАдрес);
		ТекущийОбъект.ДанныеХЗ   = Новый ХранилищеЗначения(ДанныеСохранения, РежимСжатия);
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ДанныеАдрес) Тогда
		УдалитьИзВременногоХранилища(ДанныеАдрес);
		ДанныеАдрес =  ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ДанныеХЗ");
	КонецЕсли;

КонецПроцедуры

// ПРОЦЕДУРЫ ЭЛЕМЕНТОВ ФОРМЫ
//======================================================================================================

&НаКлиенте
Процедура ВыбратьДанные(Команда)
	
	ДанныеВыбрать();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
  	
	ДанныеСохранения = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеХЗ");
	ИмяСохранения    = Объект.Наименование; 
	//ИмяСохранения    = Объект.Наименование + Объект.ДанныеРасширение; 
    ПолучитьФайл(ДанныеСохранения, ИмяСохранения, Истина);
	
КонецПроцедуры

// ПРОЦЕДУРЫ ПРОЧИЕ
//======================================================================================================

&НаКлиенте
Процедура ДанныеВыбрать()
	
	ПолученныеДанныеАдрес = "";
	Если ПоместитьФайл(ПолученныеДанныеАдрес, , Объект.ДанныеПуть, Истина, УникальныйИдентификатор)Тогда
		
		ДанныеАдрес = ПолученныеДанныеАдрес;
		
		ВыбранныйФайл = Новый Файл(Объект.ДанныеПуть);
		Объект.Наименование          =  ВыбранныйФайл.Имя;
		Объект.ДанныеТекущаяДата     =  ТекущаяДата();
		
		Модифицированность = Истина; 		
	КонецЕсли;
 	
КонецПроцедуры
